IV-Rails/projects/reddit_clone/app/views/subs/show.html.erb

    <%# sub posts %>
    <% if @sub.posts.any? %>
      <ul>
        <% @sub.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" INNER JOIN "post_subs" ON "posts"."id" = "post_subs"."post_id" WHERE "post_subs"."sub_id" = $1  [["sub_id", 5]]
SELECT  1 AS one FROM "posts" INNER JOIN "post_subs" ON "posts"."id" = "post_subs"."post_id" WHERE "post_subs"."sub_id" = $1 LIMIT $2  [["sub_id", 5], ["LIMIT", 1]]