IV-Rails/projects/art-share-api/app/controllers/artworks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
---
  def index
    user_id = params[:id]
    user = User.find_by(id: user_id)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
  def update
    artwork = Artwork.find(params[:id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 21]]
---
  def destroy
    artwork = Artwork.find(params[:id])
    if artwork.destroy

INSERT INTO "likes" ("user_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", "131"], ["likeable_type", "Artwork"], ["likeable_id", 64], ["created_at", "2020-05-28 12:38:20.596529"], ["updated_at", "2020-05-28 12:38:20.596529"]]
---
  def like
    if !params[:user_id] || !params[:id]
      render plain: 'Not found', status: :not_found
      return
    end

    like = Like.new(user_id: params[:user_id], likeable_type: 'Artwork', likeable_id: params[:id])
    if like.save

UPDATE "artworks" SET "favourite" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["favourite", false], ["updated_at", "2020-05-28 12:01:51.510891"], ["id", 64]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 64], ["LIMIT", 1]]
---
  def favourite
    if params.require(:id)
      Artwork
        .find(params[:id])
        .update(favourite: true)
      render json: Artwork.find(params[:id])

UPDATE "artworks" SET "favourite" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["favourite", false], ["updated_at", "2020-05-28 12:01:51.510891"], ["id", 64]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 64], ["LIMIT", 1]]
---
  def unfavourite
    if params.require(:id)
      Artwork
        .find(params[:id])
        .update(favourite: false)
      render json: Artwork.find(params[:id])