IV-Rails/projects/art-share-api/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 22], ["viewer_id", 43]]
---
  def create
    artwork_share = ArtworkShare.new(artwork_share_params)
    if artwork_share.save