IV-Rails/projects/art-share-api/app/controllers/comments_controller.rb

  def user_comments
    if(params[:user_id])
      render json: Comment.where(user_id: params[:user_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 102]]

  def artwork_comments
    if(params[:artwork_id])
      render json: Comment.where(artwork_id: params[:artwork_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 48]]

  def index
    # render json: User.find(params[:user_id]).comments
    # would make two SQLs
      render json: Comment.all
---
SELECT "comments".* FROM "comments"