IV-Rails/projects/art-share-api/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username LIKE '%'us'%')
SELECT "users".* FROM "users" WHERE (username LIKE '%ge%')
---
  def index
    query = request.query_parameters[:username]
    if query
      render json: User.where("username LIKE :username", username: "%#{query}%" )
    else
      render json: User.all