IV-Rails/projects/music-app/app/controllers/albums_controller.rb

SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]
---
  def show
    @album = Album.includes(:band).find(params[:id])