IV-Rails/projects/music-app/app/controllers/albums_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]
---
  def show
    @album = Album.includes(:band).find(params[:id])

SELECT "bands".* FROM "bands"
---
  def new
    @album = Album.new(band_id: params[:band_id])
    @bands = Band.all

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT "bands".* FROM "bands"
---
  def edit
    @album = Album.find(params[:id])
    @bands = Band.all

INSERT INTO "albums" ("band_id", "title", "year", "studio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["band_id", 1], ["title", "Some title"], ["year", 1941], ["studio", false], ["created_at", "2020-06-28 12:18:56.242769"], ["updated_at", "2020-06-28 12:18:56.242769"]]
SELECT "bands".* FROM "bands"
---
  def create
    @album = Album.new(album_params)
    if @album.save
      flash[:success] = 'Album successfully created'
      redirect_to @album
    else
      @bands = Band.all

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "title" = $1, "year" = $2, "updated_at" = $3 WHERE "albums"."id" = $4  [["title", "1updated"], ["year", 2343], ["updated_at", "2020-06-27 12:31:09.630507"], ["id", 1]]
SELECT "bands".* FROM "bands"
---
  def update
    @album = Album.find(params[:id])
    if @album.update_attributes(album_params)
      flash[:success] = 'Album was successfully updated'
      redirect_to @album
    else
      @bands = Band.all

SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 1]]
---
  def destroy
    album = Album.includes(:band).find(params[:id])
    if album.destroy