IV-Rails/projects/music-app/app/controllers/bands_controller.rb

  def show
    @band = Band.includes(:albums).find(params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 1]]