IV-Rails/projects/music-app/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Radiohead"], ["created_at", "2020-07-02 19:55:00.545640"], ["updated_at", "2020-07-02 19:55:00.545640"]]
---
  def create
    @band = Band.new(bands_param)
    if @band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Lambs"], ["updated_at", "2020-06-27 10:27:27.410065"], ["id", 2]]
---
  def update
    @band = Band.find(params[:id])
    if @band.update_attributes(bands_param)

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 1]]
---
  def show
    @band = Band.includes(:albums).find(params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 3]]
---
  def destroy
    @band = Band.find(params[:id])
    if @band.destroy