IV-Rails/projects/music-app/app/controllers/notes_controller.rb

  def create
    # komentarz musi należeć do zalogowanego użytkownika
    # parametr nie pochodzi od "użytkownika"
    # much simpler
    # current_user.notes.new(notes_params)

    track = Track.find(params[:id])
    note = track.notes.new(notes_params)
    note.user_id = current_user.id
    note.save
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
INSERT INTO "notes" ("user_id", "track_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["track_id", 9], ["content", "test"], ["created_at", "2020-07-04 17:26:30.710228"], ["updated_at", "2020-07-04 17:26:30.710228"]]

  def destroy
    # nie mogę użyć current_user&.notes&.find
    # a na debuggerze szło
    note = current_user.notes.find(params[:id])

    if note
      note.destroy
---
SELECT  "notes".* FROM "notes" WHERE "notes"."user_id" = $1 AND "notes"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 4], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 4]]