IV-Rails/projects/music-app/app/controllers/tracks_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "albums".* FROM "albums" WHERE "albums"."band_id" = $1 LIMIT $2  [["band_id", 1], ["LIMIT", 1]]
---
  def new
    @track = Track.new
    @album_id = params[:id]
    @album = Album.find(@album_id)
    # debugger
    @albums = Album.where(band_id: @album.band_id)

INSERT INTO "tracks" ("album_id", "title", "ord", "regular", "lyrics", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["album_id", 2], ["title", "Intro to album"], ["ord", 1], ["regular", true], ["lyrics", "instrumental"], ["created_at", "2020-07-03 05:48:56.863753"], ["updated_at", "2020-07-03 05:48:56.863753"]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 1]]
---
  def create
    @track = Track.new(track_params)
    if @track.save
      flash[:success] = 'Track successfully created'
      redirect_to @track
    else
      @album = Album.find(@album_id)
      # debugger
      @albums = Album.where(band_id: @album.band_id)

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]
---
  def show
    @note = Note.new
    @track = Track.includes(album: [:band]).find(params[:id])

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1  [["id", 2]]
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 1]]
---
  def edit
    @track = Track.includes(:album).find(params[:id])
    @album_id = params[:id]
    @album = @track.album
    @albums = Album.where(band_id: @album.band_id)

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "tracks" SET "lyrics" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3
---
  def update
    @track = Track.find(params[:id])
    if @track.update_attributes(track_params)

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1  [["id", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 1]]
---
  def destroy
    @track = Track.includes(:album).find(params[:id])
    album = @track.album
    if @track.destroy