IV-Rails/projects/music-app/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at", "activation_token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def activate
    user = User.find_by(activation_token: params[:activation_token])
    if user.nil? || user.activated
      render plain: 'Invalid token'
      return
    end
    user.toggle!(:activated)
---
SELECT  "users".* FROM "users" WHERE "users"."activation_token" = $1 LIMIT $2  [["activation_token", "jM89hBc-2xeee86SQ5oKrQ"], ["LIMIT", 1]]
UPDATE "users" SET "activated" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["activated", true], ["updated_at", "2020-07-05 08:52:28.592728"], ["id", 16]]