IV-Rails/projects/success_with_public_app/app/views/goals/show.html.erb

SELECT "cheers".* FROM "cheers" WHERE "cheers"."goal_id" = $1  [["goal_id", 1]]
---

        <p>Cheers: <%= @goal.cheers.length %></p>