VI-React/02-redux/to-do-app/app/models/todo.rb

  def tag_names=(tag_names)
    # self to tutaj instancja modelu
    self.tags = tag_names.map do |tag_name|
      Tag.find_or_create_by(name: tag_name)
---
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "abc"], ["created_at", "2021-05-11 08:21:16.890070"], ["updated_at", "2021-05-11 08:21:16.890070"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = $1 LIMIT $2  [["name", "abc"], ["LIMIT", 1]]