IV-Rails/projects/success_with_public_app/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "zapala.grzegorz"], ["LIMIT", 1]]
---
  def self.find_user_by_credentials(email, password)
    user = User.find_by(email: email)