IV-Rails/projects/cats99/app/views/cats/show.html.erb


      <% if @cat.cat_rental_requests.any? %>
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 ORDER BY start_date ASC  [["cat_id", 27]]
SELECT COUNT(*) FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1  [["cat_id", 1]]

          </thead>
          <% @cat.cat_rental_requests.each do |request| %>
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 ORDER BY start_date ASC  [["cat_id", 1]]