VI-React/02-redux/to-do-app/app/controllers/api/steps_controller.rb

SELECT "steps".* FROM "steps"
---
  def index
    # query = request.query_parameters[:username]
    render json: Step.all, status: :ok

INSERT INTO "steps" ("todo_id", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["todo_id", 1], ["title", "first step"], ["created_at", "2021-05-06 10:47:28.300866"], ["updated_at", "2021-05-06 10:47:28.300866"]]
---
  def create
    step = Step.new(step_params)
    if step.save

SELECT  "steps".* FROM "steps" WHERE "steps"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
UPDATE "steps" SET "done" = $1, "updated_at" = $2 WHERE "steps"."id" = $3  [["done", true], ["updated_at", "2021-05-06 10:47:53.447575"], ["id", 41]]
---
  def update
    step = Step.find_by(id: params[:id])
    if step
      step.update(step_params)

SELECT  "steps".* FROM "steps" WHERE "steps"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "steps" WHERE "steps"."id" = $1  [["id", 1]]
---
  def destroy
    # do params'ów należy też query parametr id
    step = Step.find_by(id: params[:id])

    if step
      step.destroy