VI-React/02-redux/to-do-app/app/controllers/api/todos_controller.rb

  def index
    # query = request.query_parameters[:username]
    render json: Todo.all, include: :tags
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."todo_id" = $1  [["todo_id", 2]]
SELECT "todos".* FROM "todos"

  def show
    todo = Todo.find_by(id: params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]

  def create
    todo = Todo.new(todo_params)
    if todo.save
---
INSERT INTO "todos" ("id", "title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["id", 1620721276632], ["title", "some title"], ["body", "some body"], ["created_at", "2021-05-11 08:21:16.927823"], ["updated_at", "2021-05-11 08:21:16.927823"]]

  def update
    # When you create/update a todo, Rails will automatically call tag_names= for you.
    # gdy parametrach jest tag_names: []
    todo = Todo.find_by(id: params[:id])
    if todo
      # tylko method! aktualizuje pozycje updated_at
      todo.update!(todo_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
UPDATE "todos" SET "title" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["title", "an updated new todo"], ["updated_at", "2021-05-01 19:07:56.405542"], ["id", 22]]

  def destroy
    todo = Todo.find_by(id: params[:id])

    if todo
      todo.destroy
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 21]]