IV-Rails/projects/music-app/app/views/albums/show.html.erb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 6]]
SELECT COUNT(*) FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 6]]
---

        <% unless @album.tracks.count.zero?  %>