IV-Rails/projects/music-app/app/views/tracks/show.html.erb

SELECT "notes".* FROM "notes" WHERE "notes"."track_id" = $1  [["track_id", 8]]
SELECT  1 AS one FROM "notes" WHERE "notes"."track_id" = $1 LIMIT $2  [["track_id", 8], ["LIMIT", 1]]
---
      <div class="margin-bottom-3">
        <% if @track.notes.any? %>
          <% @track.notes.each do |note|  %>