IV-Rails/projects/music-app/app/models/track.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def band
    Band.find_by(id: album.band_id)