IV-Rails/projects/reddit_clone/app/views/users/show.html.erb

SELECT  1 AS one FROM "subs" WHERE "subs"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---

  <% if @user.subs.any? %>