IV-Rails/projects/cats99/app/controllers/cat_rental_requests_controller.rb

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date") VALUES ($1, $2, $3) RETURNING "id"  [["cat_id", 27], ["start_date", "2020-06-03"], ["end_date", "2020-06-04"]]
SELECT "cats".* FROM "cats"
---
  def create
    @cat_rental_request = CatRentalRequest.new(cat_rental_request_params)

    if @cat_rental_request.save
      # flash[:success] = "CatRentalRequest successfully created"
      redirect_to cat_url(@cat_rental_request.cat_id)
    else
      # flash[:error] = "Something went wrong"
      @cats = Cat.all

SELECT "cats".* FROM "cats"
---
  def new
    # debugger
    @cats = Cat.all

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def approve
    # duplication
    cat_request = CatRentalRequest.find(params[:id])

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def deny
    cat_request = CatRentalRequest.find(params[:id])

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1  [["id", 5]]
---
  def current_cat_rental_request
    @rental_request ||=
      CatRentalRequest.includes(:cat).find(params[:id])