IV-Rails/projects/cats99/app/controllers/cats_controller.rb

  def show
    @cat = Cat.includes(cat_rental_requests: [:requester]).find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    # debugger
    @cat = current_user.cats.new(cat_params)

    # @cat = Cat.new(cat_params, user_id: current_user.id)

    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    @cat = current_user.cats.find(params[:id])

    if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."user_id" = $1 AND "cats"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["name", "a"], ["updated_at", "2020-06-20 18:46:45.921434"], ["id", 2]]

  def require_login_owner
    # debugger
    @cat = current_user.cats.where(id: params[:id])
    if @cat.empty?
---
SELECT  "cats".* FROM "cats" WHERE "cats"."user_id" = $1 AND "cats"."id" = $2 LIMIT $3  [["user_id", 5], ["id", 7], ["LIMIT", 1]]
SELECT  1 AS one FROM "cats" WHERE "cats"."user_id" = $1 AND "cats"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 3], ["LIMIT", 1]]