IV-Rails/projects/success_with_public_app/app/controllers/cheers_controller.rb

INSERT INTO "cheers" ("giver_id", "goal_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["giver_id", 4], ["goal_id", 1], ["created_at", "2020-07-09 11:07:54.361391"], ["updated_at", "2020-07-09 11:07:54.361391"]]
UPDATE "users" SET "cheer_count" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["cheer_count", 11], ["updated_at", "2020-07-09 11:07:54.380734"], ["id", 4]]
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    if current_user.cheer_count <= 0
      flash[:alert] = 'You have no cheers left!'
      # ? button - should not be possible at all
      redirect_back fallback_location: users_url
      return
    end

    @cheer = Cheer.new(
      # restrict to current user
      giver_id: current_user.id,
      goal_id: params[:goal_id]
    )
    if @cheer.save
      current_user.decrement_cheer_count!
      raise 'went over cheer limit' if current_user.cheer_count < 0

      goal_owner_name = Goal.find(params[:goal_id]).user.email