IV-Rails/projects/success_with_public_app/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "user_id", "commentable_type", "commentable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "123"], ["user_id", 4], ["commentable_type", "Goal"], ["commentable_id", 2], ["created_at", "2020-07-09 11:16:17.083362"], ["updated_at", "2020-07-09 11:16:17.083362"]]
---
  def create
    @comment = Comment.new(comment_params)
    # authorship is reserved to currently logged in
    @comment.user_id = current_user.id

    if @comment.save