IV-Rails/projects/success_with_public_app/app/controllers/goals_controller.rb

  def show
    # model.includes(user: [:band]).find(params[:id])
    @goal = Goal.includes(:user).find(params[:id])
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 1]]

  def edit
    @goal = Goal.includes(:user).find(params[:id])
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 135], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 166]]

  def create
    # debugger
    @goal = current_user.goals.new(goal_params)
    # @goal = Goal.new(goal_params)
    if @goal.save
---
INSERT INTO "goals" ("title", "details", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "My new goal"], ["details", "perfect details"], ["user_id", 50], ["created_at", "2020-07-08 07:53:01.721195"], ["updated_at", "2020-07-08 07:53:01.721195"]]

  def update
    # current_user
    @goal = Goal.find(params[:id])
    if @goal.update_attributes(goal_params)
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 163], ["LIMIT", 1]]
UPDATE "goals" SET "title" = $1, "details" = $2, "private" = $3, "completed" = $4, "updated_at" = $5 WHERE "goals"."id" = $6  [["title", "replaced title"], ["details", "replaced details"], ["private", true], ["completed", true], ["updated_at", "2020-07-08 11:07:37.421510"], ["id", 163]]

  def destroy
    @goal = Goal.includes(:user).find(params[:id])
    user = @goal.user
    if @goal.destroy
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 270], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 283]]
DELETE FROM "goals" WHERE "goals"."id" = $1  [["id", 270]]