IV-Rails/projects/success_with_public_app/app/controllers/users_controller.rb

  def show
    @user = User.includes(:goals).find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = $1  [["user_id", 1]]

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("email", "session_token", "password_digest", "activation_token", "created_at", "updated_at", "cheer_count") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def activate
    user = User.find_by(activation_token: params[:activation_token])
    if user.nil? || user.activated
      render plain: 'Invalid token'
      return
    end
    user.toggle!(:activated)
---
SELECT  "users".* FROM "users" WHERE "users"."activation_token" = $1 LIMIT $2  [["activation_token", "Rp_SCFAkqn_3_HCDZsbZCA"], ["LIMIT", 1]]
UPDATE "users" SET "activated" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["activated", true], ["updated_at", "2020-07-09 11:03:57.976464"], ["id", 4]]