IV-Rails/projects/success_with_public_app/app/views/users/show.html.erb


  <% if @user.goals.any? %>
---
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = $1  [["user_id", 68]]