IV-Rails/projects/cats99/app/models/cat_rental_request.rb

UPDATE "cat_rental_requests" SET "status" = $1 WHERE "cat_rental_requests"."id" = $2  [["status", "APPROVED"], ["id", 5]]
---
  def approve!
    # gdyby jednak użytkownik wysłał wniosek o zatwierdzenie odrzuconego wniosku
    # raise 'not pending' unless status == 'PENDING'

    if overlapping_pending_requests.exists?
      ActiveRecord::Base.transaction do
        update(status: 'APPROVED')
        overlapping_pending_requests.update_all(status: 'DENIED')