IV-Rails/projects/cats99/app/models/user.rb

  def find_by_credentials(username, password)
    user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "zapala.grzegorz"], ["LIMIT", 1]]