IV-Rails/projects/reddit_clone/app/views/posts/show.html.erb


    <% if @post.subs.any? %>
---
SELECT "subs".* FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 1]]
SELECT  1 AS one FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1 LIMIT $2  [["post_id", 6], ["LIMIT", 1]]


    <% if @post.comments_by_parent_id[@post.id].any? %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
SELECT  1 AS one FROM "comments" WHERE "comments"."post_id" = $1 LIMIT $2  [["post_id", 6], ["LIMIT", 1]]