IV-Rails/projects/music-app/app/views/bands/show.html.erb

      <img src="http://placekitten.com/200/200" alt="">
      <div class="flex-child-grow  <%= "flex-container align-middle-center" if @band.albums.count == 0 %>" style="margin-left: 1rem">
        <% if @band.albums.count > 0 %>
---
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 1]]
SELECT COUNT(*) FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 1]]


            <% @band.albums.each do |album| %>
---
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 1]]