IV-Rails/01-routes-and-controllers/intro/app/controllers/users_controller.rb

  def create
    # user = User.new(params.require(:user).permit(:user_attributes_here))
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Grisha"], ["email", "viral"], ["created_at", "2020-05-25 19:00:01.222389"], ["updated_at", "2020-05-25 19:00:01.222389"]]

  def update
    user = User.find_by(id: params[:id])
    # User.update

    if user
      user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Grisha"], ["updated_at", "2020-05-25 19:13:06.897888"], ["id", 1]]

  def destroy
    user = User.find_by(id: params[:id])

    if user
      user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]