IV-Rails/projects/reddit_clone/app/controllers/application_controller.rb

  def current_user
    # debugger
    return nil if session[:session_token].nil?

    @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "G7Y3_bxoSxw4EnuOpa3yeg"], ["LIMIT", 1]]