IV-Rails/projects/reddit_clone/app/controllers/comments_controller.rb

  def show
    @comment = Comment.includes(:post).find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1  [["id", 5]]

  def create
    @comment = current_user.comments.new(comment_params)
    if @comment.save
---
INSERT INTO "comments" ("content", "author_id", "post_id", "created_at", "updated_at", "parent_comment_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "So stupid '123'"], ["author_id", 2], ["post_id", 5], ["created_at", "2020-07-24 06:38:34.784698"], ["updated_at", "2020-07-24 06:38:34.784698"], ["parent_comment_id", 4]]