IV-Rails/projects/reddit_clone/app/controllers/posts_controller.rb

UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "Post do jednego suba"], ["updated_at", "2020-07-21 19:30:48.635704"], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(post_params)

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 2]]
---
  def destroy
    @post = Post.find(params[:id])
    if @post.destroy