IV-Rails/projects/reddit_clone/app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @post = Post.includes(:author).find(params[:id])

SELECT "subs".* FROM "subs"
---
  def new
    @post = Post.new
    @subs = Sub.all

SELECT "subs".* FROM "subs" WHERE 1=0
---
  def edit
    # post is in require_author
    @subs = Sub.all

SELECT "subs".* FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 1]]
INSERT INTO "post_subs" ("sub_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sub_id", 4], ["post_id", 5], ["created_at", "2020-07-21 20:40:45.506229"], ["updated_at", "2020-07-21 20:40:45.506229"]]
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Very new post"], ["url", "1"], ["content", "1"], ["author_id", 2], ["created_at", "2020-07-21 20:40:45.500386"], ["updated_at", "2020-07-21 20:40:45.500386"]]
SELECT "subs".* FROM "subs" WHERE 1=0
---
  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id

    if @post.sub_ids.length.zero?
      flash[:error] = 'Post must be belong to at least one sub'
      @subs = Sub.all
      render 'new'
      return
    end

    if @post.save
      flash[:success] = 'Post successfully created'
      redirect_to @post
    # end

    else
      flash[:error] = 'Something went wrong'
      @subs = Sub.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "subs".* FROM "subs" WHERE 1=0
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "12"], ["updated_at", "2020-07-21 20:48:07.731816"], ["id", 5]]
---
  def update
    @post = Post.find(params[:id])

    if params[:post][:sub_ids].length == 1
      flash[:error] = 'Post must be belong to at least one sub'
      @subs = Sub.all
      render 'new'
      return
    end

    if @post.update_attributes(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 3]]
---
  def destroy
    @post = Post.find(params[:id])
    if @post.destroy

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def require_author
    @post = Post.find(params[:id])