IV-Rails/projects/reddit_clone/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@gmail.com"], ["LIMIT", 1]]
---
  def create
    @user = User.find_user_by_credentials(
      params[:user][:email],
      params[:user][:password]
    )