IV-Rails/projects/reddit_clone/app/controllers/subs_controller.rb

  def show
    @sub = Sub.includes(:moderator).find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def update
    @sub = Sub.find(params[:id])
    if @sub.update_attributes(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "Elections in US"], ["description", "Forum dedicated to elections in United States."], ["updated_at", "2020-07-17 08:53:06.205829"], ["id", 1]]

  def create
    @sub = Sub.new(sub_params)
    @sub.moderator_id = current_user.id
    # debugger
    if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Elections in US"], ["description", "About elections"], ["moderator_id", 2], ["created_at", "2020-07-17 10:03:30.140135"], ["updated_at", "2020-07-17 10:03:30.140135"]]

  def destroy
    @sub = Sub.find(params[:id])
    if @sub.destroy
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "subs" WHERE "subs"."id" = $1  [["id", 3]]

  def require_moderator
    sub = Sub.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]