IV-Rails/projects/reddit_clone/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_hash", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    # debugger
    if @user.save